app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "answers" ("question_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["question_id", 7], ["created_at", "2015-11-18 00:05:11.810454"], ["updated_at", "2015-11-18 00:05:11.810454"]]
---
  def create
      @question = Question.find(params[:question_id])
      @answer = @question.answers.create(answer_params)