app/controllers/questions_controller.rb

  def index
    authenticate_user!
    # @last_viewed_question = Question.find(session[:last_viewed_question_id])
    @questions = Question.all.order(session[:sort_by])
      if current_user
        @questions = current_user.questions
      else
        @questions = Question.all
---
SELECT "questions".* FROM "questions"
SELECT "questions".* FROM "questions" INNER JOIN "responses" ON "questions"."response_id" = "responses"."id" WHERE "responses"."user_id" = ?  [["user_id", 2]]

  def create
    @question = current_user.questions.build(question_params)
    if @question.save
---
INSERT INTO "questions" ("question", "answer", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question", "What time is it?"], ["answer", "Bue"], ["user_id", 2], ["created_at", "2015-11-18 15:56:29.608826"], ["updated_at", "2015-11-18 15:56:29.608826"]]

  def destroy
  @question = Question.find(params[:id])
  @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 7]]